app/Controllers/Administrateur.php

    public function supprimerUnArticle($NoArticle)
    {
        $modelArt = new ModeleArticle();
        $modelArt->retournerArticles($NoArticle);
        $modelArt->delete($NoArticle);
---
DELETE FROM `article`
WHERE `NOARTICLE` IN ('42')

            ];

            $modelAvis = new ModeleAvis();
            $modelAvis->save($donneesAInserer);
---
INSERT INTO `avis` (`NOARTICLE`, `NOUTILISATEUR`, `TITRE`, `CONTENU`) VALUES ('4', '1', 'tt', 'tt')

    public function supprimerUnAvis($NoAvis)
    {
        $session = session();
        $modelAvis = new ModeleAvis();
        $unAvis = $modelAvis->retournerAvis($NoAvis);
        if (!$unAvis) {
            return redirect()->to('visiteur/listerLesArticles')->with('error', 'Avis introuvable');
        }
        if ($session->get('statut') == 1 || $session->get('statut') == 2 || $session->get('NOUTILISATEUR') == $unAvis['NOUTILISATEUR']) {
            $modelAvis->delete($NoAvis);
---
DELETE FROM `avis`
WHERE `NOAVIS` IN ('27')