app/Controllers/Visiteur.php

    public function listerLesArticlesAvecPagination()
    {
        $pager = \Config\Services::pager();
        $modelArt = new ModeleArticle();
        $data['lesArticles'] = $modelArt->paginate(3);
---
SELECT *
FROM `article`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `article`