app/Models/ModeleUtilisateur.php

    public function retournerUtilisateur($pId, $MotdePasse)
    {
        return $this->where(['IDENTIFIANT' => $pId, 'MOTDEPASSE' => $MotdePasse])
        ->select('NOUTILISATEUR, IDENTIFIANT, STATUT')
        ->first();
---
SELECT `NOUTILISATEUR`, `IDENTIFIANT`, `STATUT`
FROM `utilisateur`
WHERE `IDENTIFIANT` = 'toto'
AND `MOTDEPASSE` = 'admin'
 LIMIT 1