app/Models/ModeleAvis.php

SELECT *
FROM `avis`
WHERE `NOAVIS` = '27'
 LIMIT 1
---
    public function retournerAvis($NoAvis = false)
    {
        if ($NoAvis === false)
        {
            return $this->findAll();
        }
        return $this->where(['NOAVIS' => $NoAvis])
        ->first();

SELECT `avis`.`NOAVIS`, `article`.`TITRE` as `articleTitre`, `utilisateur`.`IDENTIFIANT`, `avis`.`TITRE`, `avis`.`CONTENU`
FROM `avis`
JOIN `article` ON `article`.`NOARTICLE` = `avis`.`NOARTICLE`
JOIN `utilisateur` ON `utilisateur`.`NOUTILISATEUR` = `avis`.`NOUTILISATEUR`
WHERE `avis`.`NOARTICLE` = '4'
---
    public function retournerAvisParArticles($NoArticle)
    {
        return $this->where(['avis.NOARTICLE' => $NoArticle])
        ->join('article', 'article.NOARTICLE = avis.NOARTICLE')
        ->join('utilisateur', 'utilisateur.NOUTILISATEUR = avis.NOUTILISATEUR')
        ->select('avis.NOAVIS, article.TITRE as articleTitre, utilisateur.IDENTIFIANT, avis.TITRE, avis.CONTENU')
        ->findAll();