app/Models/ModeleUtilisateur.php

    public function retournerUtilisateur($pId, $MotdePasse)
    {
        return $this->where(['IDENTIFIANT' => $pId, 'MOTDEPASSE' => $MotdePasse])->first();
---
SELECT *
FROM `utilisateur`
WHERE `IDENTIFIANT` = 'lulu'
AND `MOTDEPASSE` = 'test'
 LIMIT 1