app/Models/ModeleArticle.php

SELECT *
FROM `article`
SELECT *
FROM `article`
WHERE `NOARTICLE` = '42'
 LIMIT 1
---
    public function retournerArticles($NoArticle = false)
    {
        if ($NoArticle === false)
        {
            return $this->findAll();
        }
        return $this->where(['NOARTICLE' => $NoArticle])->first();